Configuration/InformationRegisters/бит_ум_ДокументыИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ум_ДокументыИР</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопПоле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТерриторияДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГосударственныйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ГосударственныеОрганы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопПоле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСубъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_ВидыДокументовИР</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ум_РазрезыДокументовИР</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/InformationRegisters/бит_ум_ДокументыИР/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПредупредитьОСрокеДействияПатентов();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Предупреждает, если срок действия патента выходит за двенадцать месяцев со дня выдачи.
//
// Пункт 5 статьи 13.3 Федерального закона от 25.07.2002 № 115-ФЗ: патент выдается на срок от
// одного до двенадцати месяцев и может продлеваться неоднократно, но общий срок с учетом
// продлений не может составлять более двенадцати месяцев со дня выдачи.
//
// Запись не отклоняем: сведения вводят и задним числом, и по документам, выданным до изменения
// правил, — решение остается за пользователем.
//
Процедура ПредупредитьОСрокеДействияПатентов()

	ВидПатента = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.бит_ум_ВидыДокументовИР.Патент");

	Для Каждого ЗаписьРегистра Из ЭтотОбъект Цикл

		Если ЗаписьРегистра.ВидДокумента <> ВидПатента
			ИЛИ НЕ ЗначениеЗаполнено(ЗаписьРегистра.ДатаВыдачи)
			ИЛИ НЕ ЗначениеЗаполнено(ЗаписьРегистра.СрокДействия) Тогда
			Продолжить;
		КонецЕсли;

		ПредельныйСрок = ДобавитьМесяц(НачалоДня(ЗаписьРегистра.ДатаВыдачи), 12);
		Если НачалоДня(ЗаписьРегистра.СрокДействия) <= ПредельныйСрок Тогда
			Продолжить;
		КонецЕсли;

		ТекстПредупреждения = НСтр("ru = 'Срок действия патента, выданного %1, выходит за двенадцать
			|месяцев со дня выдачи (пункт 5 статьи 13.3 Федерального закона № 115-ФЗ).';
			|en = 'The validity period of the patent issued on %1 exceeds twelve months from the
			|issue date (clause 5 of article 13.3 of Federal Law No. 115-FZ).'");

		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(ТекстПредупреждения, Формат(ЗаписьРегистра.ДатаВыдачи, "ДЛФ=D")));

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
